app/controllers/todos_controller.rb

  def create
    @todo = Todo.new(todo_params)

    respond_to do |format|
      if @todo.save
---
INSERT INTO "todos" ("title", "notes", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "House extension"], ["notes", "Create blueprint for the new addition to the garage"], ["created_at", "2015-06-05 18:56:15.822935"], ["updated_at", "2015-06-05 18:56:15.822935"]]

  def update
    respond_to do |format|
      if @todo.update(todo_params)
---
UPDATE "todos" SET "title" = $1, "notes" = $2, "updated_at" = $3 WHERE "todos"."id" = $4  [["title", "buy computer"], ["notes", "Choose between a MacBook Pro, MacBook Air or iMac "], ["updated_at", "2015-06-05 18:57:25.164390"], ["id", 3]]